examples/tumor_chip_linear_gradient/data/diagnostic/ladder_scan/case_021/system/controlDict
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      controlDict;
}

application     scalarTransportFoam;

startFrom       latestTime;
stopAt          endTime;
endTime         1590.0;

deltaT          1;

writeControl    timeStep;
writeInterval   1590;

purgeWrite      2;

writeFormat     ascii;
writePrecision  8;
writeCompression off;

timeFormat      general;
timePrecision   6;

runTimeModifiable true;
